of/narrow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    top
    {
        type            fixedValue;
        value           uniform (1 0 0);
        // type            symmetryPlane;
    }

    bottom
    {
        type            noSlip;
        // type            symmetryPlane;
    }

    inlet
    {
        type            noSlip;
        // type            freestream;
        // freestreamValue uniform (1 0 0);
    }

    outlet
    {
        type            noSlip;
        // type            freestream;
        // freestreamValue uniform (1 0 0);
    }

    deck
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
